Reports/ПодробнаяСтатисткаWMIПоСерверам_ат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Report>
		<Properties>
			<Name>ПодробнаяСтатисткаWMIПоСерверам_ат</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаКонца</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сервер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Серверы_ат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяДняИНочи</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CPU</Name>
					<Type>
						<v8:Type>mxl:SpreadsheetDocument</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RAM</Name>
					<Type>
						<v8:Type>mxl:SpreadsheetDocument</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>HDD</Name>
					<Type>
						<v8:Type>mxl:SpreadsheetDocument</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Reports/ПодробнаяСтатисткаWMIПоСерверам_ат/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПараметрСервер 					= Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Сервер"));
	Если Не ПараметрСервер = Неопределено тогда
		Если Параметры.Свойство("Сервер") тогда	
		//	ПараметрСервер.Значение		= параметры.Сервер;
		//	ПараметрСервер.Использование	= Истина;
			Отчет.Сервер			= Параметры.Сервер;
		КонецЕсли;
		
		
	Иначе
	КонецЕсли;
	
	
	ПараметрНачПер 					= Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("НачалоПериода"));
	Если  Не ПараметрНачПер = Неопределено тогда
		Если Параметры.Свойство("ДатаНачала") тогда
			//ПараметрНачПер.Значение		= параметры.ДатаНачала;
			//ПараметрНачПер.Использование	= Истина;
			Отчет.ДатаНачала 		= Параметры.ДатаНачала;
 	 
		Иначе
			
			Отчет.ДатаНачала 		= ТекущаяДата() - 24*60*60; // сутки


		КонецЕсли;
	Иначе
		
			Отчет.ДатаНачала 		= ТекущаяДата() - 24*60*60; // сутки

		
	КонецЕсли;
	
	
	ПараметрКонПер					= Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("КонецПериода"));
	Если Не ПараметрКонПер = Неопределено тогда
		Если Параметры.Свойство("ДатаКонца") тогда
			
			//ПараметрКонПер.Значение		= параметры.ДатаКонца;
			//ПараметрКонПер.Использование	= Истина;
			Отчет.ДатаКонца	= Параметры.ДатаКонца;
		Иначе
			Отчет.ДатаКонца	=  ТекущаяДата();

		КонецЕсли;
	Иначе
		     Отчет.ДатаКонца	= ТекущаяДата(); // сутки
			 
	КонецЕсли;

КонецПроцедуры
